Reports/бит_СправкаПоПовестке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_СправкаПоПовестке</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Comment>Лицевой счет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проживающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/бит_ПроживающиеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПроживающиеПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВладелецКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПрописки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КудаВыписан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткудаПрибыл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусФизЛицаДляИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДоляПлощадиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_СтрокаРодствДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьПериодВКопииФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаРегистрацииДляФЛС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаВыпискиДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ПомещенВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ВПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ТрудоваяДеятельностьПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ТрудоваяДеятельностьПроживающих</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОрганизацииТрудовойЗанятостиПроживающих</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсКласс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидыЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыЗанятостиПроживающих</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РодЗанятий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ДопСведенияОПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ДопСведенияОПроживающих</Name>
			<Comment>Дополнительные сведения о проживающих</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ДополнительныеДанныеОПроживающих</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проживающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСведений</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ДополнительныеДанныеОПроживающих</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_СтатусПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СтатусПроживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постоянно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Временно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроживает</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/бит_СправкаПоПовестке/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ФормированиеОтчета
	
// Выполняет запрос и формирует табличный документ-результат отчета.
// В соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом.
//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета.
//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках. 
//  ДокументОбъект - если указан, то печать отчета по документу.
//
Процедура СформироватьОтчет(Знач ПараметрыОтчета, АдресХранилища) Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ДокументРезультат.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб			= Истина;
	
	Макет = Отчеты.бит_СправкаПоПовестке.ПолучитьМакет("Справка");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	НомерСтроки = 0;
	
	ОбластьШапка.Параметры.Проживающй   = ПараметрыОтчета.Проживающий;
	ОбластьШапка.Параметры.ДатаРождения = Формат(ПараметрыОтчета.ДатаРождения, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Адрес        = ПараметрыОтчета.Адрес;
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	ВывестиПроживающихСовметсно(ДокументРезультат, ПараметрыОтчета, Макет, НомерСтроки);
	
	ВывестиПроживающихОтдельно(ДокументРезультат, ПараметрыОтчета, Макет, НомерСтроки);
	
	ВывестиУмерших(ДокументРезультат, ПараметрыОтчета, Макет, НомерСтроки);
	
	ДокументРезультат.Вывести(ОбластьПодвал);
	
	ПоместитьВоВременноеХранилище(ДокументРезультат, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область ВыводКатегорийГраждан

// Процедура выводит совместно проживающих.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ВывестиПроживающихСовметсно(ДокументРезультат, ПараметрыОтчета, Макет, НомерСтроки)
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"      , КонецДня(ПараметрыОтчета.Период));
	Запрос.УстановитьПараметр("ЛицевойСчет" , ПараметрыОтчета.ЛицевойСчет);
	Запрос.УстановитьПараметр("ФизЛицо"     , ПараметрыОтчета.Проживающий);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.МестоРождения КАК МестоРождения,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.Наименование КАК ФИО,
	|	бит_ТрудоваяДеятельностьПроживающихСрезПоследних.Должность
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ТрудоваяДеятельностьПроживающих.СрезПоследних(&Период, ) КАК бит_ТрудоваяДеятельностьПроживающихСрезПоследних
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ТрудоваяДеятельностьПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Период
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|	И бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания = ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Постоянно)
	|	И бит_ПроживающиеПоЛССрезПоследних.ФизЛицо <> &ФизЛицо";
	
	Результат      = Запрос.Выполнить(); 
	Выборка = Результат.Выбрать();

	Если Результат.Пустой() Тогда
	
		ДокументРезультат.Вывести(ОбластьСтрока);
		Возврат;
	
	КонецЕсли; 
	
	Пока Выборка.Следующий() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		ОбластьСтрока.Параметры.НомерСтроки      = НомерСтроки;
		ОбластьСтрока.Параметры.ФИО              = Выборка.ФИО;
		ОбластьСтрока.Параметры.ДатаРождения     = Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy");
		ОбластьСтрока.Параметры.СтепеньРодства   = Выборка.СтепеньРодства;
		ОбластьСтрока.Параметры.МестоРождения    = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(Выборка.МестоРождения);
		ОбластьСтрока.Параметры.Трудоспособность = "";
		
		ОбластьСтрока.Параметры.РодЗанятий = Выборка.Должность;
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		
	КонецЦикла; 
	
КонецПроцедуры // ()

// Процедура выводит отдельно проживающих.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ВывестиПроживающихОтдельно(ДокументРезультат, ПараметрыОтчета, Макет, НомерСтроки)
	
	ОбластьОтступ        = Макет.ПолучитьОбласть("Отступ");
	ОбластьШапкаОтдельно = Макет.ПолучитьОбласть("ШапкаОтдельно");
	ОбластьСтрока        = Макет.ПолучитьОбласть("Строка");
	
	ДокументРезультат.Вывести(ОбластьОтступ);
	ДокументРезультат.Вывести(ОбластьШапкаОтдельно);
	
	ВидыСведений = Новый Массив;
	ВидыСведений.Добавить(ПланыВидовХарактеристик.бит_ДополнительныеДанныеОПроживающих.РодЗанятий);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"      , КонецДня(ПараметрыОтчета.Период));
	Запрос.УстановитьПараметр("ЛицевойСчет" , ПараметрыОтчета.ЛицевойСчет);
	Запрос.УстановитьПараметр("ФизЛицо"     , ПараметрыОтчета.Проживающий);
	Запрос.УстановитьПараметр("ВидыСведений", ВидыСведений);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.МестоРождения КАК МестоРождения,
	|	бит_ДопСведенияОПроживающихСрезПоследних.ВидСведений,
	|	бит_ДопСведенияОПроживающихСрезПоследних.Значение,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.Наименование КАК ФИО
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ДопСведенияОПроживающих.СрезПоследних(&Период, ВидСведений В (&ВидыСведений)) КАК бит_ДопСведенияОПроживающихСрезПоследних
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ДопСведенияОПроживающихСрезПоследних.Проживающий
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Период
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|	И бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания = ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Временно)
	|	И бит_ПроживающиеПоЛССрезПоследних.ФизЛицо <> &ФизЛицо
	|ИТОГИ
	|	МАКСИМУМ(СтепеньРодства),
	|	МАКСИМУМ(ДатаРождения),
	|	МАКСИМУМ(МестоРождения),
	|	МАКСИМУМ(ФИО)
	|ПО
	|	ФизЛицо";
	
	Результат      = Запрос.Выполнить(); 
	ВыборкаФизЛицо = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если Результат.Пустой() Тогда
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		Возврат;
		
	КонецЕсли; 
	
	Пока ВыборкаФизЛицо.Следующий() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		ОбластьСтрока.Параметры.НомерСтроки      = НомерСтроки;
		ОбластьСтрока.Параметры.ФИО              = ВыборкаФизЛицо.ФИО;
		ОбластьСтрока.Параметры.ДатаРождения     = Формат(ВыборкаФизЛицо.ДатаРождения, "ДФ=dd.MM.yyyy");
		ОбластьСтрока.Параметры.СтепеньРодства   = ВыборкаФизЛицо.СтепеньРодства;
		ОбластьСтрока.Параметры.МестоРождения    = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(ВыборкаФизЛицо.МестоРождения);
		ОбластьСтрока.Параметры.РодЗанятий       = "";
		ОбластьСтрока.Параметры.Трудоспособность = "";
		
		Выборка = ВыборкаФизЛицо.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ВидСведений = ПланыВидовХарактеристик.бит_ДополнительныеДанныеОПроживающих.РодЗанятий Тогда
				
				ОбластьСтрока.РодЗанятий = Выборка.Значение;
				
			КонецЕсли; 
			
		КонецЦикла;
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		
	КонецЦикла; 
	
КонецПроцедуры // ()

// Процедура выводит умерших.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ВывестиУмерших(ДокументРезультат, ПараметрыОтчета, Макет, НомерСтроки)
	
	ОбластьОтступ   = Макет.ПолучитьОбласть("Отступ");
	ОбластьШапкаУМР = Макет.ПолучитьОбласть("ШапкаУМР");
	ОбластьСтрока   = Макет.ПолучитьОбласть("Строка");
	
	ДокументРезультат.Вывести(ОбластьОтступ);
	ДокументРезультат.Вывести(ОбластьШапкаУМР);
	
	ВидыСведений = Новый Массив;
	ВидыСведений.Добавить(ПланыВидовХарактеристик.бит_ДополнительныеДанныеОПроживающих.РодЗанятий);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"      , КонецДня(ПараметрыОтчета.Период));
	Запрос.УстановитьПараметр("ЛицевойСчет" , ПараметрыОтчета.ЛицевойСчет);
	Запрос.УстановитьПараметр("ФизЛицо"     , ПараметрыОтчета.Проживающий);
	Запрос.УстановитьПараметр("ВидыСведений", ВидыСведений);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.МестоРождения КАК МестоРождения,
	|	бит_ДопСведенияОПроживающихСрезПоследних.ВидСведений,
	|	бит_ДопСведенияОПроживающихСрезПоследних.Значение,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.Наименование КАК ФИО
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ДопСведенияОПроживающих.СрезПоследних(&Период, ВидСведений В (&ВидыСведений)) КАК бит_ДопСведенияОПроживающихСрезПоследних
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ДопСведенияОПроживающихСрезПоследних.Проживающий
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации <= &Период
	|	И бит_ПроживающиеПоЛССрезПоследних.ПричинаВыписки = ЗНАЧЕНИЕ(Справочник.бит_ПричиныВыписки.ПоСмертно)
	|	И бит_ПроживающиеПоЛССрезПоследних.ФизЛицо <> &ФизЛицо
	|ИТОГИ
	|	МАКСИМУМ(СтепеньРодства),
	|	МАКСИМУМ(ДатаРождения),
	|	МАКСИМУМ(МестоРождения),
	|	МАКСИМУМ(ФИО)
	|ПО
	|	ФизЛицо";
	
	Результат      = Запрос.Выполнить(); 
	ВыборкаФизЛицо = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если Результат.Пустой() Тогда
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		Возврат;
		
	КонецЕсли; 
	
	Пока ВыборкаФизЛицо.Следующий() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		ОбластьСтрока.Параметры.НомерСтроки      = НомерСтроки;
		ОбластьСтрока.Параметры.ФИО              = ВыборкаФизЛицо.ФИО;
		ОбластьСтрока.Параметры.ДатаРождения     = Формат(ВыборкаФизЛицо.ДатаРождения, "ДФ=dd.MM.yyyy");
		ОбластьСтрока.Параметры.СтепеньРодства   = ВыборкаФизЛицо.СтепеньРодства;
		ОбластьСтрока.Параметры.МестоРождения    = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(ВыборкаФизЛицо.МестоРождения);
		ОбластьСтрока.Параметры.РодЗанятий       = "";
		ОбластьСтрока.Параметры.Трудоспособность = "";
		
		Выборка = ВыборкаФизЛицо.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ВидСведений = ПланыВидовХарактеристик.бит_ДополнительныеДанныеОПроживающих.РодЗанятий Тогда
				
				ОбластьСтрока.РодЗанятий = Выборка.Значение;
				
			КонецЕсли; 
			
		КонецЦикла;
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		
	КонецЦикла; 
	
КонецПроцедуры // ()

#КонецОбласти

#КонецЕсли
